{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["font", 0, 0], ["char", 0, 0], ["bold", 0, 0], ["italic", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 64, 64, 1], "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "padding": "same", "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "padding": "same", "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"name": "dropout_4", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "padding": "same", "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_6", "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "padding": "same", "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_7", "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"data_format": "channels_last", "padding": "valid", "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_7", "config": {"name": "dropout_7", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "padding": "same", "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "padding": "same", "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_5", "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "padding": "same", "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_8", "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "padding": "same", "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "conv2d_9", "dilation_rate": [1, 1], "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_2", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_3", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_3"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_4", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 32, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 32, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_3"}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 16, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_5"}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_7", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 16, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_7"}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"name": "dropout_2", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"name": "dropout_5", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_8", "config": {"name": "dropout_8", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_10", "config": {"name": "dropout_10", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 32, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_2"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 16, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_4"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 16, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_6"}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_8", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 16, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_8"}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"name": "dropout_3", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_6", "config": {"name": "dropout_6", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_9", "config": {"name": "dropout_9", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_11", "config": {"name": "dropout_11", "rate": 0.25, "seed": null, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["dense_8", 0, 0, {}]]]}, {"class_name": "Dense", "name": "font", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 11, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "font"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "char", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 94, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "char"}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "Dense", "name": "bold", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 2, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "bold"}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"class_name": "Dense", "name": "italic", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "units": 2, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "italic"}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}]}, "keras_version": "2.2.0"}