__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 64, 64, 1)    0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 64, 64, 32)   832         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 64, 64, 32)   9248        conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 32, 32, 32)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 32, 32, 32)   0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 32)   25632       dropout_4[0][0]                  
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 32)   9248        conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 16, 16, 32)   0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32, 32, 32)   0           max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 16, 16, 32)   0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 32)   9248        dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 32)   9248        dropout_4[0][0]                  
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 16, 16, 32)   9248        dropout_7[0][0]                  
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 16, 16, 32)   9248        dropout_7[0][0]                  
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 32768)        0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 32768)        0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 8192)         0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
flatten_4 (Flatten)             (None, 8192)         0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 32)           1048608     flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 32)           1048608     flatten_2[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 16)           131088      flatten_3[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 16)           131088      flatten_4[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 32)           0           dense_1[0][0]                    
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 32)           0           dense_3[0][0]                    
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 16)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 16)           0           dense_7[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           1056        dropout_2[0][0]                  
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 16)           528         dropout_5[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 16)           272         dropout_8[0][0]                  
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 16)           272         dropout_10[0][0]                 
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 32)           0           dense_2[0][0]                    
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 16)           0           dense_4[0][0]                    
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 16)           0           dense_6[0][0]                    
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 16)           0           dense_8[0][0]                    
__________________________________________________________________________________________________
font (Dense)                    (None, 11)           363         dropout_3[0][0]                  
__________________________________________________________________________________________________
char (Dense)                    (None, 94)           1598        dropout_6[0][0]                  
__________________________________________________________________________________________________
bold (Dense)                    (None, 2)            34          dropout_9[0][0]                  
__________________________________________________________________________________________________
italic (Dense)                  (None, 2)            34          dropout_11[0][0]                 
==================================================================================================
Total params: 2,445,501
Trainable params: 2,445,501
Non-trainable params: 0
__________________________________________________________________________________________________
